903257958/stm32_oop_driver/stm32f407vg_i2c_sw_bmp280/driver/i2c.h
#ifndef __I2C_H
#define __I2C_H

#include <stdint.h>
#include <stdio.h>
#include <stdbool.h>

#if defined(STM32F10X_HD) || defined(STM32F10X_MD)
	#include "stm32f10x.h"
	typedef GPIO_TypeDef*	I2CGPIOPort_t;
	
#elif defined(STM32F40_41xxx) || defined(STM32F411xE) || defined(STM32F429_439xx)
	#include "stm32f4xx.h"
	typedef GPIO_TypeDef*	I2CGPIOPort_t;
    
#elif defined (GD32F10X_MD) || defined (GD32F10X_HD)
    #include "gd32f10x.h"
    typedef uint32_t	I2CGPIOPort_t;
	
#else
	#error i2c.h: No processor defined!
#endif

typedef struct {
	I2CGPIOPort_t scl_port;			// SCL端口
	uint32_t scl_pin;				// SCL引脚
	I2CGPIOPort_t sda_port;			// SDA端口
	uint32_t sda_pin;				// SDA引脚
}I2CConfig_t;

typedef struct I2CDev {
	I2CConfig_t config;
	bool init_flag;											// 初始化标志
	int8_t (*start)(struct I2CDev *dev);					// 软件I2C起始
	int8_t (*stop)(struct I2CDev *dev);						// 软件I2C停止
	int8_t (*send_byte)(struct I2CDev *dev, uint8_t byte);	// 软件I2C发送一个字节
	uint8_t (*recv_byte)(struct I2CDev *dev);				// 软件I2C接收一个字节
	int8_t (*send_ack)(struct I2CDev *dev, uint8_t ack);	// 软件I2C发送应答位
	uint8_t (*recv_ack)(struct I2CDev *dev);				// 软件I2C接收应答位
	int8_t (*read_reg)(struct I2CDev *dev, uint8_t dev_addr, uint8_t reg_addr, uint8_t *data);					// 软件I2C读寄存器
	int8_t (*read_regs)(struct I2CDev *dev, uint8_t dev_addr, uint8_t reg_addr, uint16_t num, uint8_t data[]);	// 软件I2C读多个寄存器
	int8_t (*write_reg)(struct I2CDev *dev, uint8_t dev_addr, uint8_t reg_addr, uint8_t data);					// 软件I2C写寄存器
	int8_t (*write_regs)(struct I2CDev *dev, uint8_t dev_addr, uint8_t reg_addr, uint16_t num, uint8_t data[]);// 软件I2C写多个寄存器
	int8_t (*deinit)(struct I2CDev *dev);					// 去初始化
}I2CDev_t;

int8_t i2c_sw_init(I2CDev_t *dev);

#endif
